#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/calyptia/fluent-bit-infra/runs/run-ytFuDLrBARHz3s6i

Waiting for the plan to start...

Terraform v0.14.7
Initializing plugins and modules...
tls_private_key.gh-runner-provision-key: Refreshing state... [id=7d2b71a947985b05873fa16c3f290a2aeca67a6c]
cloudflare_record.perf-test: Refreshing state... [id=bbea913930c29ee79a82eaa643fc4120]
cloudflare_record.builder: Refreshing state... [id=f39b751e3ebbbad7355c5ee13f4319db]
cloudflare_record.dev-arm: Refreshing state... [id=e4ebbc597ba56e701e36b22b716192f1]
metal_ssh_key.gh-runner-provision-ssh-pub-key: Refreshing state... [id=4d238aaf-11fe-4afb-9e9b-34ffb4bec56d]
google_compute_address.static: Refreshing state... [id=projects/fluent-bit-ci/regions/us-east1/addresses/ipv4-address]
google_compute_address.static-01: Refreshing state... [id=projects/fluent-bit-ci/regions/us-east1/addresses/ipv4-address-01]
google_compute_disk.test-data-01: Refreshing state... [id=projects/fluent-bit-ci/zones/us-east1-c/disks/test-data-01]
google_compute_disk.test-data: Refreshing state... [id=projects/fluent-bit-ci/zones/us-east1-c/disks/test-data]
google_compute_network.default-services: Refreshing state... [id=projects/fluent-bit-ci/global/networks/default-public-svc-network]
github_team.fluent-bit-sandbox-maintainers: Refreshing state... [id=5969310]
github_repository.fluent-bit-unstable-releases: Refreshing state... [id=fluent-bit-unstable-releases]
github_repository.fluent-bit-sandbox: Refreshing state... [id=fluent-bit-sandbox]
metal_device.gh-runners["x64"]: Refreshing state... [id=47b71ede-1401-4f41-857d-b83215e52621]
metal_device.gh-runners["arm64"]: Refreshing state... [id=ec1f3769-1331-4be1-8207-81688e4f2696]
github_team_membership.fluent-bit-sandbox-maintainers["patrick-stephens"]: Refreshing state... [id=5969310:patrick-stephens]
github_team_membership.fluent-bit-sandbox-maintainers["niedbalski"]: Refreshing state... [id=5969310:niedbalski]
github_team_membership.fluent-bit-sandbox-maintainers["edsiper"]: Refreshing state... [id=5969310:edsiper]
github_team_membership.fluent-bit-sandbox-maintainers["agup006"]: Refreshing state... [id=5969310:agup006]
google_compute_subnetwork.default-services-subnet: Refreshing state... [id=projects/fluent-bit-ci/regions/us-east1/subnetworks/default-public-svc-subnet]
google_compute_firewall.ssh_default: Refreshing state... [id=projects/fluent-bit-ci/global/firewalls/default-public-svc-ssh]
github_repository_environment.staging-environment: Refreshing state... [id=fluent-bit:staging]
github_branch_protection_v3.default-branch-protection["1.9"]: Refreshing state... [id=fluent-bit:1.9]
github_branch_protection_v3.default-branch-protection["master"]: Refreshing state... [id=fluent-bit:master]
github_branch_protection_v3.default-branch-protection["1.8"]: Refreshing state... [id=fluent-bit:1.8]
github_actions_secret.appveyor_account: Refreshing state... [id=fluent-bit:APPVEYOR_ACCOUNT]
github_repository_environment.unstable-environment: Refreshing state... [id=fluent-bit:unstable]
github_actions_secret.appveyor_token: Refreshing state... [id=fluent-bit:APPVEYOR_TOKEN]
github_branch.mirror-main-branch: Refreshing state... [id=fluent-bit-mirror:mirror-main]
github_branch_protection_v3.fluent-bit-unstable-releases: Refreshing state... [id=fluent-bit-unstable-releases:main]
null_resource.gh-runners-provision["arm64"]: Refreshing state... [id=5869905610083058987]
cloudflare_record.docs: Refreshing state... [id=e2ca6fd8bc5ac015448c741d0b850e61]
null_resource.gh-runners-provision["x64"]: Refreshing state... [id=4138320923887792658]
cloudflare_record.legacy-releases: Refreshing state... [id=7b3866176a8e15b107c9a6f3504cf441]
cloudflare_record.short-registry: Refreshing state... [id=c4a4f01a2be5fea4c8a7b20bc28a85fe]
github_repository_environment.release-environment: Refreshing state... [id=fluent-bit:release]
cloudflare_record.test: Refreshing state... [id=f861ed655d4ed62b4c19c82de120179c]
cloudflare_record.root-www: Refreshing state... [id=d09f8846b7b52cbd89011619edf8dc7d]
cloudflare_record.gh-runners["arm64"]: Refreshing state... [id=6f2f6feb5e03e0729f2d0b071ccfb07a]
cloudflare_record.gh-runners["x64"]: Refreshing state... [id=50337bb3f462f47a3135bdff3e2e9d35]
cloudflare_page_rule.docs-fluentbitio: Refreshing state... [id=9b028036a9507ab028b1b49809572732]
cloudflare_record.apt: Refreshing state... [id=5ca012769dedb027234bdb0e96c2fead]
cloudflare_record.cloud-monitoring-api-dev: Refreshing state... [id=b733bf55decf54e7cd37bdc6bbcef130]
cloudflare_record.www-old: Refreshing state... [id=63d899fe0abd52851193cbed706a58d4]
cloudflare_record.legacy-server: Refreshing state... [id=182111a207d70486ee95e4d2b160e92f]
cloudflare_page_rule.releases-fluentbitio: Refreshing state... [id=1bbac17c5d0bcd0da6e779361ec5ca41]
cloudflare_record.fluentd-config-validator-dev: Refreshing state... [id=954fec0843bf6cc062a6aabd9c9e1811]
cloudflare_record.config-validator-dev: Refreshing state... [id=8a57626a631ddc89017f20c11a3b9ce4]
cloudflare_record.config-validator: Refreshing state... [id=4e3cd831fb498c19cad0e1c4f30d800e]
cloudflare_record.registry: Refreshing state... [id=c8896e619f5c0ace02059e0457c23ffe]
cloudflare_record.packages-test: Refreshing state... [id=f0ec9c52b66c208dadbf5569d333f188]
cloudflare_record.www: Refreshing state... [id=962890f07d1facb9c4f95f71c0dadbac]
cloudflare_record.backup: Refreshing state... [id=67c3eccf0a0834b01884701016dffd8a]
cloudflare_record.packages: Refreshing state... [id=f7ce9c8999d7f4fa812ff1176543e81e]
google_compute_instance.long-running-test-01: Refreshing state... [id=projects/fluent-bit-ci/zones/us-east1-c/instances/long-running-test-01]
cloudflare_record.test-subdomain: Refreshing state... [id=99f3293646a1f4f35772245bbbe873bc]
cloudflare_page_rule.downloads-fluentbitio: Refreshing state... [id=34ebbbf674a600e76a0ea6a2b91d975d]
cloudflare_record.fluentd-config-validator: Refreshing state... [id=a683b867e465952b0a41ddbeb8a464c8]
google_compute_instance.long-running-test: Refreshing state... [id=projects/fluent-bit-ci/zones/us-east1-c/instances/long-running-test]
github_actions_secret.fluent-bit-ci-opensearch-password["fluent-bit-mirror"]: Refreshing state... [id=fluent-bit-mirror:OPENSEARCH_ADMIN_PASSWORD]
github_actions_secret.fluent-bit-ci-opensearch-password["fluent-bit-ci"]: Refreshing state... [id=fluent-bit-ci:OPENSEARCH_ADMIN_PASSWORD]
github_actions_secret.fluent-bit-ci-opensearch-password["fluent-bit"]: Refreshing state... [id=fluent-bit:OPENSEARCH_ADMIN_PASSWORD]
github_actions_secret.fluent-bit-ci-azure-subscription-id["fluent-bit-mirror"]: Refreshing state... [id=fluent-bit-mirror:AZURE_SUBSCRIPTION_ID]
github_actions_secret.fluent-bit-ci-azure-subscription-id["fluent-bit"]: Refreshing state... [id=fluent-bit:AZURE_SUBSCRIPTION_ID]
github_actions_secret.fluent-bit-ci-azure-subscription-id["fluent-bit-ci"]: Refreshing state... [id=fluent-bit-ci:AZURE_SUBSCRIPTION_ID]
github_actions_secret.fluent-bit-ci-opensearch-aws-access-id["fluent-bit"]: Refreshing state... [id=fluent-bit:OPENSEARCH_AWS_ACCESS_ID]
github_actions_secret.fluent-bit-ci-opensearch-aws-access-id["fluent-bit-mirror"]: Refreshing state... [id=fluent-bit-mirror:OPENSEARCH_AWS_ACCESS_ID]
github_actions_secret.fluent-bit-ci-opensearch-aws-access-id["fluent-bit-ci"]: Refreshing state... [id=fluent-bit-ci:OPENSEARCH_AWS_ACCESS_ID]
github_actions_secret.fluent-bit-ci-opensearch-aws-secret-key["fluent-bit-ci"]: Refreshing state... [id=fluent-bit-ci:OPENSEARCH_AWS_SECRET_KEY]
github_actions_secret.fluent-bit-ci-opensearch-aws-secret-key["fluent-bit-mirror"]: Refreshing state... [id=fluent-bit-mirror:OPENSEARCH_AWS_SECRET_KEY]
github_actions_secret.fluent-bit-ci-opensearch-aws-secret-key["fluent-bit"]: Refreshing state... [id=fluent-bit:OPENSEARCH_AWS_SECRET_KEY]
github_actions_secret.fluent-bit-ci-azure-tenant-id["fluent-bit-ci"]: Refreshing state... [id=fluent-bit-ci:AZURE_TENANT_ID]
github_actions_secret.fluent-bit-ci-azure-tenant-id["fluent-bit"]: Refreshing state... [id=fluent-bit:AZURE_TENANT_ID]
github_actions_secret.fluent-bit-ci-azure-tenant-id["fluent-bit-mirror"]: Refreshing state... [id=fluent-bit-mirror:AZURE_TENANT_ID]
github_actions_secret.ffluent-bit-ci-azure-client-secret["fluent-bit-ci"]: Refreshing state... [id=fluent-bit-ci:AZURE_CLIENT_SECRET]
github_actions_secret.ffluent-bit-ci-azure-client-secret["fluent-bit-mirror"]: Refreshing state... [id=fluent-bit-mirror:AZURE_CLIENT_SECRET]
github_actions_secret.ffluent-bit-ci-azure-client-secret["fluent-bit"]: Refreshing state... [id=fluent-bit:AZURE_CLIENT_SECRET]
github_actions_secret.fluent-bit-ci-azure-client-id["fluent-bit-mirror"]: Refreshing state... [id=fluent-bit-mirror:AZURE_CLIENT_ID]
github_actions_secret.fluent-bit-ci-azure-client-id["fluent-bit"]: Refreshing state... [id=fluent-bit:AZURE_CLIENT_ID]
github_actions_secret.fluent-bit-ci-azure-client-id["fluent-bit-ci"]: Refreshing state... [id=fluent-bit-ci:AZURE_CLIENT_ID]
github_team_repository.fluent-bit-sandbox-maintainers: Refreshing state... [id=5969310:fluent-bit-sandbox]
github_branch_protection_v3.fluent-bit-sandbox: Refreshing state... [id=fluent-bit-sandbox:main]
github_actions_environment_secret.staging-bucket-secret: Refreshing state... [id=fluent-bit:staging:AWS_S3_BUCKET_STAGING]
github_actions_environment_secret.staging-aws-secret-access-key-secret: Refreshing state... [id=fluent-bit:staging:AWS_SECRET_ACCESS_KEY]
github_actions_environment_secret.staging-aws-access-key-id-secret: Refreshing state... [id=fluent-bit:staging:AWS_ACCESS_KEY_ID]
github_actions_environment_secret.staging-gpg-private-key-secret: Refreshing state... [id=fluent-bit:staging:GPG_PRIVATE_KEY]
github_actions_environment_secret.staging-gpg-private-key-passphrase-secret: Refreshing state... [id=fluent-bit:staging:GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_environment_secret.unstable-release-repos["unstable"]: Refreshing state... [id=fluent-bit:unstable:RELEASE_REPO]
github_actions_environment_secret.unstable-release-repos["staging"]: Refreshing state... [id=fluent-bit:staging:RELEASE_REPO]
github_actions_environment_secret.unstable-release-tokens["staging"]: Refreshing state... [id=fluent-bit:staging:RELEASE_TOKEN]
github_actions_environment_secret.unstable-release-tokens["unstable"]: Refreshing state... [id=fluent-bit:unstable:RELEASE_TOKEN]
github_branch_default.mirror-default-branch: Refreshing state... [id=fluent-bit-mirror]
github_actions_environment_secret.release-staging-bucket-secret: Refreshing state... [id=fluent-bit:release:AWS_S3_BUCKET_STAGING]
github_actions_environment_secret.release-dockerhub-token: Refreshing state... [id=fluent-bit:release:DOCKERHUB_TOKEN]
github_actions_environment_secret.release-dockerhub-org: Refreshing state... [id=fluent-bit:release:DOCKERHUB_ORGANIZATION]
github_actions_environment_secret.release-aws-secret-access-key-secret: Refreshing state... [id=fluent-bit:release:AWS_SECRET_ACCESS_KEY]
github_actions_environment_secret.release-server-username: Refreshing state... [id=fluent-bit:release:FLUENTBITIO_USERNAME]
github_actions_environment_secret.release-aws-access-key-id-secret: Refreshing state... [id=fluent-bit:release:AWS_ACCESS_KEY_ID]
github_actions_environment_secret.release-server-sshkey: Refreshing state... [id=fluent-bit:release:FLUENTBITIO_SSHKEY]
github_actions_environment_secret.release-cosign-private-key: Refreshing state... [id=fluent-bit:release:COSIGN_PRIVATE_KEY]
github_actions_environment_secret.release-server-hostname: Refreshing state... [id=fluent-bit:release:FLUENTBITIO_HOST]
github_actions_environment_secret.release-bucket-secret: Refreshing state... [id=fluent-bit:release:AWS_S3_BUCKET_RELEASE]
github_actions_environment_secret.release-gpg-private-key-secret: Refreshing state... [id=fluent-bit:release:GPG_PRIVATE_KEY]
github_actions_environment_secret.release-gpg-private-key-passphrase-secret: Refreshing state... [id=fluent-bit:release:GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_environment_secret.release-dockerhub-username: Refreshing state... [id=fluent-bit:release:DOCKERHUB_USERNAME]
github_actions_secret.mirror-release-secrets["DOCKERHUB_TOKEN"]: Refreshing state... [id=fluent-bit-mirror:DOCKERHUB_TOKEN]
github_actions_secret.mirror-release-secrets["FLUENTBITIO_USERNAME"]: Refreshing state... [id=fluent-bit-mirror:FLUENTBITIO_USERNAME]
github_actions_secret.mirror-release-secrets["DOCKERHUB_ORGANIZATION"]: Refreshing state... [id=fluent-bit-mirror:DOCKERHUB_ORGANIZATION]
github_actions_secret.mirror-release-secrets["FLUENTBITIO_SSHKEY"]: Refreshing state... [id=fluent-bit-mirror:FLUENTBITIO_SSHKEY]
github_actions_secret.mirror-release-secrets["AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=fluent-bit-mirror:AWS_SECRET_ACCESS_KEY]
github_actions_secret.mirror-release-secrets["COSIGN_PRIVATE_KEY"]: Refreshing state... [id=fluent-bit-mirror:COSIGN_PRIVATE_KEY]
github_actions_secret.mirror-release-secrets["DOCKERHUB_USERNAME"]: Refreshing state... [id=fluent-bit-mirror:DOCKERHUB_USERNAME]
github_actions_secret.mirror-release-secrets["GPG_PRIVATE_KEY_PASSPHRASE"]: Refreshing state... [id=fluent-bit-mirror:GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.mirror-release-secrets["AWS_S3_BUCKET_STAGING"]: Refreshing state... [id=fluent-bit-mirror:AWS_S3_BUCKET_STAGING]
github_actions_secret.mirror-release-secrets["AWS_S3_BUCKET_RELEASE"]: Refreshing state... [id=fluent-bit-mirror:AWS_S3_BUCKET_RELEASE]
github_actions_secret.mirror-release-secrets["GPG_PRIVATE_KEY"]: Refreshing state... [id=fluent-bit-mirror:GPG_PRIVATE_KEY]
github_actions_secret.mirror-release-secrets["FLUENTBITIO_HOST"]: Refreshing state... [id=fluent-bit-mirror:FLUENTBITIO_HOST]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # cloudflare_record.builder will be destroyed
  - resource "cloudflare_record" "builder" {
      - created_on  = "2021-02-17T01:28:11.852342Z" -> null
      - hostname    = "builder.fluentbit.io" -> null
      - id          = "f39b751e3ebbbad7355c5ee13f4319db" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on = "2021-02-17T01:28:11.852342Z" -> null
      - name        = "builder" -> null
      - priority    = 0 -> null
      - proxiable   = true -> null
      - proxied     = false -> null
      - ttl         = 1 -> null
      - type        = "A" -> null
      - value       = "147.75.192.91" -> null
      - zone_id     = "bbb9a1aa534bb80b90bfa7ea32eaf536" -> null

      - timeouts {}
    }

  # cloudflare_record.dev-arm will be destroyed
  - resource "cloudflare_record" "dev-arm" {
      - created_on  = "2021-02-26T02:46:45.531586Z" -> null
      - hostname    = "dev-arm.fluentbit.io" -> null
      - id          = "e4ebbc597ba56e701e36b22b716192f1" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on = "2021-02-26T02:46:45.531586Z" -> null
      - name        = "dev-arm" -> null
      - priority    = 0 -> null
      - proxiable   = true -> null
      - proxied     = false -> null
      - ttl         = 1 -> null
      - type        = "A" -> null
      - value       = "139.178.64.142" -> null
      - zone_id     = "bbb9a1aa534bb80b90bfa7ea32eaf536" -> null
    }

  # cloudflare_record.perf-test will be destroyed
  - resource "cloudflare_record" "perf-test" {
      - created_on  = "2021-02-26T02:46:45.244213Z" -> null
      - hostname    = "perf-test.fluentbit.io" -> null
      - id          = "bbea913930c29ee79a82eaa643fc4120" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on = "2021-02-26T02:46:45.244213Z" -> null
      - name        = "perf-test" -> null
      - priority    = 0 -> null
      - proxiable   = true -> null
      - proxied     = false -> null
      - ttl         = 1 -> null
      - type        = "A" -> null
      - value       = "147.75.53.77" -> null
      - zone_id     = "bbb9a1aa534bb80b90bfa7ea32eaf536" -> null
    }

  # github_repository.fluent-bit-sandbox will be updated in-place
  ~ resource "github_repository" "fluent-bit-sandbox" {
      ~ allow_auto_merge            = true -> false
        id                          = "fluent-bit-sandbox"
        name                        = "fluent-bit-sandbox"
        # (34 unchanged attributes hidden)
    }

  # metal_device.packages-fluent-bit will be created
  + resource "metal_device" "packages-fluent-bit" {
      + access_private_ipv4              = (known after apply)
      + access_public_ipv4               = (known after apply)
      + access_public_ipv6               = (known after apply)
      + always_pxe                       = false
      + billing_cycle                    = "hourly"
      + created                          = (known after apply)
      + deployed_facility                = (known after apply)
      + deployed_hardware_reservation_id = (known after apply)
      + force_detach_volumes             = false
      + hostname                         = "packages-managed.fluentbit.io"
      + id                               = (known after apply)
      + locked                           = (known after apply)
      + metro                            = "da"
      + network                          = (known after apply)
      + network_type                     = (known after apply)
      + operating_system                 = "ubuntu_20_04"
      + plan                             = "c3.small.x86"
      + ports                            = (known after apply)
      + project_id                       = "25d09386-ae25-4259-a239-f8c5e14a3c0e"
      + root_password                    = (sensitive value)
      + ssh_key_ids                      = (known after apply)
      + state                            = (known after apply)
      + updated                          = (known after apply)
      + user_data                        = (sensitive value)
      + wait_for_reservation_deprovision = false
    }

  # metal_ssh_key.packages-fluent-bit-provision-ssh-pub-key will be created
  + resource "metal_ssh_key" "packages-fluent-bit-provision-ssh-pub-key" {
      + created     = (known after apply)
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "packages-fluent-bit-provision-ssh-pub-key"
      + owner_id    = (known after apply)
      + public_key  = (known after apply)
      + updated     = (known after apply)
    }

  # null_resource.packages-fluent-bit-provision will be created
  + resource "null_resource" "packages-fluent-bit-provision" {
      + id = (known after apply)
    }

  # tls_private_key.packages-fluent-bit-provision-key will be created
  + resource "tls_private_key" "packages-fluent-bit-provision-key" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

Plan: 4 to add, 1 to change, 3 to destroy.

Warning: Deprecated Resource

  on machines.tf line 5, in data "metal_device" "legacy_www":
   5: data "metal_device" "legacy_www" {

Equinix Metal Provider is now Deprecated (End-of-Life scheduled for July 1,
2023) meaning that this software is only supported or maintained by Equinix
Metal and its community in a case-by-case basis. The Equinix provider
(https://registry.terraform.io/providers/equinix/equinix/latest/docs) has full
support for existing Terraform managed Metal resources once Terraform
configuration and state are adapted. The Equinix provider manages resources
including Network Edge and Fabric in addition to Metal. Please review the
Metal to Equinix provider migration guide:
https://registry.terraform.io/providers/equinix/equinix/latest/docs/guides/migration_guide_equinix_metal

(and 4 more similar warnings elsewhere)


```
</details>
*Pushed by: @patrick-stephens, Action: `pull_request`*